patterns = ['ا', 'ب', 'پ', 'ت', 'ث', 'ج', 'چ', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'ژ', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع',
            'او ', ' ان ', ' کن ', ' کا ', ' کو ', ' فا ', ' فو ', ' فی ', ' پا ', ' پو', 'ف', 'ق', 'ک', 'گ', 'ل', 'م', 'ن', 'و', 'ه', 'ی', 'الف',
            'اب', 'آ', 'آب', 'یا', 'ای', 'یو', 'یس', 'شر', 'کت', 'را', 'من', 'نا', 'نی', 'بی', 'با', 'بو', 'نو',
            ' نو ', ' رو ', ' غو ', ' شو ']

pattern_2 = ['پول', 'سرمایه', 'شرکت', 'مجموعه', 'هلدینگ', 'گروه', 'صنعت']

pattern_3 = ['شرکت نگرش تحلیل سیستم ها']
